/* per1 是 个人缴纳的五险一金，其值为应发工资*21% 
   per2 是 全月应纳税所得额，其值为应发工资-五险一金-5000(起征点)
   per3 是 个人所得税的税额，其值为按表格计算
   per4 是 账户四险，其值为应发工资*11%+单位缴付四险金额
   per5 是 账户一金，其值为应发工资*10%+单位缴付一金金额
   per6 是 个人四险，其值为应发工资*11%
   per7 是 个人一金，其值为应发工资*10%
   */
var per1=0, per2=0; per3=0; per4=0; per5=0; per6=0; per7=0;
function calculate(){
    /* $("att1").innerHTML 是 个人税前收入，即应发工资 */
    /* per1 是 个人缴纳的五险一金，其值为应发工资*21% */
    per1=$("texts").value*(0.08+0.02+0.01+0.10);
    /* per2 是 全月应纳税所得额 */
    if($("texts").value-per1<5000)
        per2=0;
    else
        per2=$("texts").value-per1-5000;
    /* per3 是 个人所得税的税额 */
    if(per2<36000)
        per3=per2*0.03;
    else if(per2<144000)
        per3=36000*0.03+(per2-36000)*0.10;
    else if(per2<300000)
        per3=36000*0.03+(144000-36000)*0.10+(per2-144000)*0.20;
    else if(per2<420000)
        per3=36000*0.03+(144000-36000)*0.10+(300000-144000)*0.20+(per2-300000)*0.25;
    else if(per2<660000)
        per3=36000*0.03+(144000-36000)*0.10+(300000-144000)*0.20+(420000-300000)*0.25+(per2-420000)*0.30;
    else if(per2<960000)
        per3=36000*0.03+(144000-36000)*0.10+(300000-144000)*0.20+(420000-300000)*0.25+(660000-420000)*0.30+(per2-660000)*0.35;
    else
        per3=36000*0.03+(144000-36000)*0.10+(300000-144000)*0.20+(420000-300000)*0.25+(660000-420000)*0.30+(960000-660000)*0.35+(per2-960000)*0.45;
    per6=$("texts").value*(0.08+0.02+0.01);
    per7=$("texts").value*(0.10);
    per4=-$("texts2").value-per6;
    per5=-$("texts3").value-per7;
    $("att1").innerHTML=$("texts").value-per1-per3;
    $("att2").innerHTML=-per4;
    $("att3").innerHTML=-per5;
}

function $(i){
    return document.getElementById(i)
}